<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * اجرای Migration
     */
    public function up(): void
    {
        Schema::create('notifications', function (Blueprint $table) {

            $table->id();

            /*
            |--------------------------------------------------------------------------
            | کاربری که اعلان برای اوست
            |--------------------------------------------------------------------------
            */

            $table->foreignId('user_id')
                ->constrained()
                ->cascadeOnDelete();


            /*
            |--------------------------------------------------------------------------
            | نوع اعلان
            |--------------------------------------------------------------------------
            */

            $table->string('type');


            /*
            |--------------------------------------------------------------------------
            | عنوان اعلان
            |--------------------------------------------------------------------------
            */

            $table->string('title');


            /*
            |--------------------------------------------------------------------------
            | متن اعلان
            |--------------------------------------------------------------------------
            */

            $table->text('message');


            /*
            |--------------------------------------------------------------------------
            | اطلاعات اضافی اعلان
            |--------------------------------------------------------------------------
            |
            | مثلاً:
            | loan_request_id
            | loan_id
            | payment_id
            |
            */

            $table->json('data')
                ->nullable();


            /*
            |--------------------------------------------------------------------------
            | زمان خوانده شدن اعلان
            |--------------------------------------------------------------------------
            |
            | null = هنوز خوانده نشده
            | مقدار تاریخ = خوانده شده
            |
            */

            $table->timestamp('read_at')
                ->nullable();


            $table->timestamps();


            /*
            |--------------------------------------------------------------------------
            | Index
            |--------------------------------------------------------------------------
            */

            $table->index([
                'user_id',
                'read_at',
            ]);

        });
    }


    /**
     * حذف Migration
     */
    public function down(): void
    {
        Schema::dropIfExists('notifications');
    }
};
